In [1]:
import numpy as np
import pandas as pd
from math import sqrt
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
movie = pd.read_csv(r"C:\Users\91934\OneDrive\Desktop\Movie-Recommendation-System-Using-Sentiment-Analysis-main\data_set\movie.csv\movie.csv")
rating = pd.read_csv(r"C:\Users\91934\OneDrive\Desktop\Movie-Recommendation-System-Using-Sentiment-Analysis-main\data_set\rating.csv\rating.csv")

In [3]:
movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rating.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [5]:
movie.describe()

             movieId
count   27278.000000
mean    59855.480570
std     44429.314697
min         1.000000
25%      6931.250000
50%     68068.000000
75%    100293.250000
max    131262.000000

In [6]:
rating.describe()

             userId       movieId        rating
count  2.000026e+07  2.000026e+07  2.000026e+07
mean   6.904587e+04  9.041567e+03  3.525529e+00
std    4.003863e+04  1.978948e+04  1.051989e+00
min    1.000000e+00  1.000000e+00  5.000000e-01
25%    3.439500e+04  9.020000e+02  3.000000e+00
50%    6.914100e+04  2.167000e+03  3.500000e+00
75%    1.036370e+05  4.770000e+03  4.000000e+00
max    1.384930e+05  1.312620e+05  5.000000e+00

In [7]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27278 entries, 0 to 27277
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  27278 non-null  int64
 1   title    27278 non-null  object
 2   genres   27278 non-null  object
dtypes: int64(1), object(2)
memory usage: 639.5+ KB

In [8]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000263 entries, 0 to 20000262
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  object
dtypes: float64(1), int64(2), object(1)
memory usage: 610.4+ MB

In [9]:
movie.shape

(27278, 3)

In [10]:
rating.shape

(20000263, 4)

In [11]:
movie.isna().any()

movieId    False
title      False
genres     False
dtype: bool

In [12]:
rating.isna().any()

userId       False
movieId      False
rating       False
timestamp    False
dtype: bool

In [13]:
movie['year'] = movie.title.str.extract('(\(\d\d\d\d\))', expand = False)
movie['year'] = movie.year.str.extract('(\d\d\d\d)', expand = False)

In [14]:
movie['title'] = movie.title.str.replace('(\(\d\d\d\d\))', '',regex=True)
movie['title'] = movie['title'].apply(lambda x: x.strip())

In [15]:
movie.drop(columns = ["genres"], inplace = True)

In [16]:
movie.head()

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

In [17]:
rating.drop(columns = ["timestamp"], inplace = True)

In [18]:
rating.head()

   userId  movieId  rating
0       1        2     3.5
1       1       29     3.5
2       1       32     3.5
3       1       47     3.5
4       1       50     3.5

In [48]:
#print("Titles in movie DataFrame:\n", movie['title'].tolist())

In [20]:
import pandas as pd
import re

# Your user data
user = [
    {'title': 'Breakfast Club, The', 'rating': 4},
    {'title': 'Toy Story', 'rating': 2.5},
    {'title': 'Jumanji', 'rating': 3},
    {'title': 'Pulp Fiction', 'rating': 4.5},
    {'title': 'Akira', 'rating': 5}
]

# Convert user data to DataFrame
inputMovie = pd.DataFrame(user)

# Load the movie dataset
movie = pd.read_csv(r"C:\Users\91934\OneDrive\Desktop\Movie-Recommendation-System-Using-Sentiment-Analysis-main\data_set\movie.csv\movie.csv")

# Function to clean movie titles by removing the year (e.g., "Toy Story (1995)" → "Toy Story")
def clean_title(title):
    return re.sub(r" \(\d{4}\)$", "", title)  # Removes " (YYYY)" from titles

# Apply the cleaning function to the `movie` dataset
movie['clean_title'] = movie['title'].apply(clean_title)


# Filter the movies based on cleaned titles
matching_titles = movie[movie['clean_title'].isin(inputMovie['title'].tolist())]

# Display results
print("Number of matches found:", len(matching_titles))
print("Matching titles:\n", matching_titles[['movieId', 'title']])

Number of matches found: 5
Matching titles:
       movieId                       title
0           1            Toy Story (1995)
1           2              Jumanji (1995)
293       296         Pulp Fiction (1994)
1246     1274                Akira (1988)
1884     1968  Breakfast Club, The (1985)

In [21]:
Id = movie[movie['clean_title'].isin(inputMovie['title'].tolist())]
inputMovie = pd.merge(Id, inputMovie, left_on="clean_title", right_on="title", how="inner")

# Drop unnecessary columns if they exist
columns_to_drop = ['year', 'clean_title']
for col in columns_to_drop:
    if col in inputMovie.columns:
        inputMovie = inputMovie.drop(col, axis=1)

print("Final Merged Data:\n", inputMovie)

Final Merged Data:
    movieId                     title_x  \
0        1            Toy Story (1995)
1        2              Jumanji (1995)
2      296         Pulp Fiction (1994)
3     1274                Akira (1988)
4     1968  Breakfast Club, The (1985)

                                        genres              title_y  rating
0  Adventure|Animation|Children|Comedy|Fantasy            Toy Story     2.5
1                   Adventure|Children|Fantasy              Jumanji     3.0
2                  Comedy|Crime|Drama|Thriller         Pulp Fiction     4.5
3            Action|Adventure|Animation|Sci-Fi                Akira     5.0
4                                 Comedy|Drama  Breakfast Club, The     4.0

In [22]:
users = rating[rating['movieId'].isin(inputMovie['movieId'].tolist())]

In [23]:
users.head()

     userId  movieId  rating
0         1        2     3.5
11        1      296     4.0
236       3        1     4.0
451       5        2     3.0
517       6        1     5.0

In [24]:
users.shape

(168730, 3)

In [25]:
userSubsetGroup = users.groupby(['userId'])

In [26]:
len(userSubsetGroup['userId'])

93823

In [27]:
userSubsetGroup = sorted(userSubsetGroup,  key=lambda x: len(x[1]), reverse=True)

In [28]:
userSubsetGroup[0:3]

[((91,),
        userId  movieId  rating
  9621      91        1     4.0
  9622      91        2     3.5
  9669      91      296     3.5
  9826      91     1274     2.5
  9903      91     1968     4.0),
 ((294,),
         userId  movieId  rating
  37452     294        1     4.5
  37453     294        2     4.5
  37504     294      296     4.5
  37648     294     1274     4.5
  37731     294     1968     5.0),
 ((586,),
         userId  movieId  rating
  81164     586        1     2.5
  81165     586        2     3.0
  81226     586      296     5.0
  81390     586     1274     4.0
  81499     586     1968     3.0)]

In [29]:
userSubsetGroup = userSubsetGroup

In [30]:
pearsonCorDict = {}
for name, group in userSubsetGroup:
    group = group.sort_values(by='movieId')
    inputMovie = inputMovie.sort_values(by='movieId')
    n = len(group)
    
    temp = inputMovie[inputMovie['movieId'].isin(group['movieId'].tolist())]
    tempRatingList = temp['rating'].tolist()
    tempGroupList = group['rating'].tolist()
    Sxx = sum([i**2 for i in tempRatingList]) - pow(sum(tempRatingList),2)/float(n)
    Syy = sum([i**2 for i in tempGroupList]) - pow(sum(tempGroupList),2)/float(n)
    Sxy = sum( i*j for i, j in zip(tempRatingList, tempGroupList)) - sum(tempRatingList)*sum(tempGroupList)/float(n)
    
    if Sxx != 0 and Syy != 0:
        pearsonCorDict[name] = Sxy/sqrt(Sxx*Syy)
    else:
        pearsonCorDict[name] = 0

In [46]:
#pearsonCorDict.items()

In [47]:
#print(pearsonCorDict)

In [33]:
pearsonDF = pd.DataFrame.from_dict(pearsonCorDict, orient='index')
pearsonDF.columns = ['similarityIndex']
pearsonDF['userId'] = pearsonDF.index
pearsonDF.index = range(len(pearsonDF))
pearsonDF.head()

   similarityIndex  userId
0        -0.689062   (91,)
1         0.107833  (294,)
2         0.783645  (586,)
3         0.444103  (648,)
4         0.462665  (775,)

In [34]:
topUsers=pearsonDF.sort_values(by='similarityIndex', ascending=False)[0:50]
topUsers.head()

       similarityIndex     userId
17821              1.0  (114862,)
16902              1.0  (105389,)
8106               1.0   (11718,)
14910              1.0   (83705,)
16850              1.0  (104656,)

In [35]:
print("topUsers['userId'] dtype:", topUsers['userId'].dtype)
print("topUsers['userId'] sample:\n", topUsers['userId'].head())
print("Type of first userId value:", type(topUsers['userId'].iloc[0]))

topUsers['userId'] dtype: object
topUsers['userId'] sample:
 17821    (114862,)
16902    (105389,)
8106      (11718,)
14910     (83705,)
16850    (104656,)
Name: userId, dtype: object
Type of first userId value: <class 'tuple'>

In [36]:
# If userId is a tuple, extract the first element
if topUsers['userId'].apply(type).eq(tuple).any():
    print("Converting tuples in userId to single values...")
    topUsers['userId'] = topUsers['userId'].apply(lambda x: x[0] if isinstance(x, tuple) else x)

# Now convert to int64
topUsers['userId'] = topUsers['userId'].astype('int64')
rating['userId'] = rating['userId'].astype('int64')

# Perform the merge
topUsersRating = topUsers.merge(rating, left_on='userId', right_on='userId', how='inner')
print("Merged DataFrame:\n", topUsersRating.head())

Converting tuples in userId to single values...
Merged DataFrame:
    similarityIndex  userId  movieId  rating
0              1.0  114862        2     2.0
1              1.0  114862        9     1.0
2              1.0  114862       10     4.0
3              1.0  114862       18     4.0
4              1.0  114862       24     4.0

In [37]:
topUsersRating=topUsers.merge(rating, left_on='userId', right_on='userId', how='inner')
topUsersRating.head()

   similarityIndex  userId  movieId  rating
0              1.0  114862        2     2.0
1              1.0  114862        9     1.0
2              1.0  114862       10     4.0
3              1.0  114862       18     4.0
4              1.0  114862       24     4.0

In [38]:
topUsersRating['weightedRating'] = topUsersRating['similarityIndex']*topUsersRating['rating']
topUsersRating.head()

   similarityIndex  userId  movieId  rating  weightedRating
0              1.0  114862        2     2.0             2.0
1              1.0  114862        9     1.0             1.0
2              1.0  114862       10     4.0             4.0
3              1.0  114862       18     4.0             4.0
4              1.0  114862       24     4.0             4.0

In [39]:
tempTopUsersRating = topUsersRating.groupby('movieId').sum()[['similarityIndex','weightedRating']]
tempTopUsersRating.columns = ['sum_similarityIndex','sum_weightedRating']
tempTopUsersRating.head()

         sum_similarityIndex  sum_weightedRating
movieId
1                       24.0                49.0
2                       32.0                63.0
3                        7.0                18.0
4                        4.0                 7.5
5                        7.0                20.0

In [40]:
recommendation_df = pd.DataFrame()
recommendation_df['weighted average recommendation score'] = tempTopUsersRating['sum_weightedRating']/tempTopUsersRating['sum_similarityIndex']
recommendation_df['movieId'] = tempTopUsersRating.index
recommendation_df.head()

         weighted average recommendation score  movieId
movieId
1                                     2.041667        1
2                                     1.968750        2
3                                     2.571429        3
4                                     1.875000        4
5                                     2.857143        5

In [41]:
recommendation_df = recommendation_df.sort_values(by='weighted average recommendation score', ascending=False)
recommendation_df.head(10)

         weighted average recommendation score  movieId
movieId
2208                                       5.0     2208
5500                                       5.0     5500
81819                                      5.0    81819
2621                                       5.0     2621
6001                                       5.0     6001
182                                        5.0      182
6104                                       5.0     6104
6301                                       5.0     6301
506                                        5.0      506
195                                        5.0      195

In [42]:
print(movie.dtypes)
print(recommendation_df.dtypes)
print(recommendation_df['movieId'].isnull().sum())  # Count missing values
print("Movies in `movie` dataset:", movie['movieId'].unique())  # Show some IDs
print("Movies in Recommendation:", recommendation_df.head(10)['movieId'].tolist())

movieId         int64
title          object
genres         object
clean_title    object
dtype: object
weighted average recommendation score    float64
movieId                                    int64
dtype: object
0
Movies in `movie` dataset: [     1      2      3 ... 131258 131260 131262]
Movies in Recommendation: [2208, 5500, 81819, 2621, 6001, 182, 6104, 6301, 506, 195]

In [43]:
print("Max Movie ID in `movie` dataset:", movie['movieId'].max())

Max Movie ID in `movie` dataset: 131262

In [44]:
movie = pd.read_csv(r"C:\Users\91934\OneDrive\Desktop\Movie-Recommendation-System-Using-Sentiment-Analysis-main\data_set\movie.csv\movie.csv")  # Make sure this is the correct file
print("Max Movie ID:", movie['movieId'].max())

Max Movie ID: 131262

In [45]:
movie.loc[movie['movieId'].isin(recommendation_df.head(10)['movieId'].tolist())]

,movieId,title,genres
180,182,Moonlight and Valentino (1995),Drama|Romance
193,195,Something to Talk About (1995),Comedy|Drama|Romance
502,506,Orlando (1992),Drama|Fantasy|Romance
2124,2208,"Lady Vanishes, The (1938)",Drama|Mystery|Thriller
2536,2621,Xiu Xiu: The Sent-Down Girl (Tian yu) (1998),Drama
5403,5500,Top Secret! (1984),Comedy
5902,6001,"King of Comedy, The (1983)",Comedy|Drama
6005,6104,Monty Python Live at the Hollywood Bowl (1982),Comedy
6202,6301,Straw Dogs (1971),Drama|Thriller
16187,81819,Biutiful (2010),Drama